---
kind: method
id: M:Autodesk.Revit.DB.GridNode.#ctor(System.Int32,System.Int32)
source: html/e2739a2a-c369-58ab-2871-10ac77b08ae5.htm
---
# Autodesk.Revit.DB.GridNode.#ctor Method

Initializes a new instance of the GridNode class

## Syntax (C#)
```csharp
public GridNode(
	int uIndex,
	int vIndex
)
```

## Parameters
- **uIndex** (`System.Int32`)
- **vIndex** (`System.Int32`)